MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFM064/mcu.h
#define _CNENE_CNIEE7_POSITION                   0x00000007
#define _CNENE_CNIEE7_MASK                       0x00000080
#define _CNENE_CNIEE7_LENGTH                     0x00000001

#define _CNENE_w_POSITION                        0x00000000
#define _CNENE_w_MASK                            0xFFFFFFFF
#define _CNENE_w_LENGTH                          0x00000020

#define _CNSTATE_CNSTATE0_POSITION               0x00000000
#define _CNSTATE_CNSTATE0_MASK                   0x00000001
#define _CNSTATE_CNSTATE0_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE1_POSITION               0x00000001
#define _CNSTATE_CNSTATE1_MASK                   0x00000002
#define _CNSTATE_CNSTATE1_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE2_POSITION               0x00000002
#define _CNSTATE_CNSTATE2_MASK                   0x00000004
#define _CNSTATE_CNSTATE2_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE3_POSITION               0x00000003
#define _CNSTATE_CNSTATE3_MASK                   0x00000008
#define _CNSTATE_CNSTATE3_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE4_POSITION               0x00000004
#define _CNSTATE_CNSTATE4_MASK                   0x00000010
#define _CNSTATE_CNSTATE4_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE5_POSITION               0x00000005
#define _CNSTATE_CNSTATE5_MASK                   0x00000020
#define _CNSTATE_CNSTATE5_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE6_POSITION               0x00000006
#define _CNSTATE_CNSTATE6_MASK                   0x00000040
#define _CNSTATE_CNSTATE6_LENGTH                 0x00000001

#define _CNSTATE_CNSTATE7_POSITION               0x00000007
#define _CNSTATE_CNSTATE7_MASK                   0x00000080
#define _CNSTATE_CNSTATE7_LENGTH                 0x00000001

#define _CNSTATE_w_POSITION                      0x00000000
#define _CNSTATE_w_MASK                          0xFFFFFFFF
#define _CNSTATE_w_LENGTH                        0x00000020

#define _CNNEE_CNNEE0_POSITION                   0x00000000
#define _CNNEE_CNNEE0_MASK                       0x00000001
#define _CNNEE_CNNEE0_LENGTH                     0x00000001

#define _CNNEE_CNNEE1_POSITION                   0x00000001
#define _CNNEE_CNNEE1_MASK                       0x00000002
#define _CNNEE_CNNEE1_LENGTH                     0x00000001

#define _CNNEE_CNNEE2_POSITION                   0x00000002
#define _CNNEE_CNNEE2_MASK                       0x00000004
#define _CNNEE_CNNEE2_LENGTH                     0x00000001

#define _CNNEE_CNNEE3_POSITION                   0x00000003
#define _CNNEE_CNNEE3_MASK                       0x00000008
#define _CNNEE_CNNEE3_LENGTH                     0x00000001

#define _CNNEE_CNNEE4_POSITION                   0x00000004
#define _CNNEE_CNNEE4_MASK                       0x00000010
#define _CNNEE_CNNEE4_LENGTH                     0x00000001

#define _CNNEE_CNNEE5_POSITION                   0x00000005
#define _CNNEE_CNNEE5_MASK                       0x00000020
#define _CNNEE_CNNEE5_LENGTH                     0x00000001

#define _CNNEE_CNNEE6_POSITION                   0x00000006
#define _CNNEE_CNNEE6_MASK                       0x00000040
#define _CNNEE_CNNEE6_LENGTH                     0x00000001

#define _CNNEE_CNNEE7_POSITION                   0x00000007
#define _CNNEE_CNNEE7_MASK                       0x00000080
#define _CNNEE_CNNEE7_LENGTH                     0x00000001

#define _CNFE_CNFE0_POSITION                     0x00000000
#define _CNFE_CNFE0_MASK                         0x00000001
#define _CNFE_CNFE0_LENGTH                       0x00000001

#define _CNFE_CNFE1_POSITION                     0x00000001
#define _CNFE_CNFE1_MASK                         0x00000002
#define _CNFE_CNFE1_LENGTH                       0x00000001

#define _CNFE_CNFE2_POSITION                     0x00000002
#define _CNFE_CNFE2_MASK                         0x00000004
#define _CNFE_CNFE2_LENGTH                       0x00000001

#define _CNFE_CNFE3_POSITION                     0x00000003
#define _CNFE_CNFE3_MASK                         0x00000008
#define _CNFE_CNFE3_LENGTH                       0x00000001

#define _CNFE_CNFE4_POSITION                     0x00000004
#define _CNFE_CNFE4_MASK                         0x00000010
#define _CNFE_CNFE4_LENGTH                       0x00000001

#define _CNFE_CNFE5_POSITION                     0x00000005
#define _CNFE_CNFE5_MASK                         0x00000020
#define _CNFE_CNFE5_LENGTH                       0x00000001

#define _CNFE_CNFE6_POSITION                     0x00000006
#define _CNFE_CNFE6_MASK                         0x00000040
#define _CNFE_CNFE6_LENGTH                       0x00000001

#define _CNFE_CNFE7_POSITION                     0x00000007
#define _CNFE_CNFE7_MASK                         0x00000080
#define _CNFE_CNFE7_LENGTH                       0x00000001

#define _SRCON0E_SR0E0_POSITION                  0x00000000
#define _SRCON0E_SR0E0_MASK                      0x00000001
#define _SRCON0E_SR0E0_LENGTH                    0x00000001

#define _SRCON0E_SR0E1_POSITION                  0x00000001
#define _SRCON0E_SR0E1_MASK                      0x00000002
#define _SRCON0E_SR0E1_LENGTH                    0x00000001

#define _SRCON0E_SR0E2_POSITION                  0x00000002
#define _SRCON0E_SR0E2_MASK                      0x00000004
#define _SRCON0E_SR0E2_LENGTH                    0x00000001

#define _SRCON0E_SR0E3_POSITION                  0x00000003
#define _SRCON0E_SR0E3_MASK                      0x00000008
#define _SRCON0E_SR0E3_LENGTH                    0x00000001

#define _SRCON1E_SR1E0_POSITION                  0x00000000
#define _SRCON1E_SR1E0_MASK                      0x00000001
#define _SRCON1E_SR1E0_LENGTH                    0x00000001

#define _SRCON1E_SR1E1_POSITION                  0x00000001
#define _SRCON1E_SR1E1_MASK                      0x00000002
#define _SRCON1E_SR1E1_LENGTH                    0x00000001

#define _SRCON1E_SR1E2_POSITION                  0x00000002
#define _SRCON1E_SR1E2_MASK                      0x00000004
#define _SRCON1E_SR1E2_LENGTH                    0x00000001

#define _SRCON1E_SR1E3_POSITION                  0x00000003
#define _SRCON1E_SR1E3_MASK                      0x00000008
#define _SRCON1E_SR1E3_LENGTH                    0x00000001

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

#define _TRISF_TRISF3_POSITION                   0x00000003
#define _TRISF_TRISF3_MASK                       0x00000008
#define _TRISF_TRISF3_LENGTH                     0x00000001

#define _TRISF_TRISF4_POSITION                   0x00000004
#define _TRISF_TRISF4_MASK                       0x00000010
#define _TRISF_TRISF4_LENGTH                     0x00000001

#define _TRISF_TRISF5_POSITION                   0x00000005
#define _TRISF_TRISF5_MASK                       0x00000020
#define _TRISF_TRISF5_LENGTH                     0x00000001

